**Creating a DataFrame**

In [1]:
df <- data.frame(
    "EmpID" = 1:5, "Age" = c(24, 30, 50, 35, 55), 
    "Name" = c("Adam", "Mary", "John", "David", "Sarah"), 
    stringsAsFactors = F)
df
is.factor(df$Name)

  EmpID Age Name
1 1     24  Adam
2 2     30  Mary
3 3     50  John
4 4     35  David
5 5     55  Sarah

[1] FALSE

**What does *stringsAsFactors* do?**
*Note the class of the Name column*

In [2]:
t <- data.frame("EmpID" = 1:5, "Age" = sample(20:65,5), "Name" = c("Adam", "Mary", "John", "David", "Sarah"))
t
paste('is.factor(t$Name): ', is.factor(t$Name))

  EmpID Age Name
1 1     64  Adam
2 2     49  Mary
3 3     31  John
4 4     40  David
5 5     63  Sarah

[1] "is.factor(t$Name):  TRUE"

In [3]:
dim(df) # dimensions
head(df,3) # show first 3 rows, default is 6 
tail(df,3) # show last 3 rows

[1] 5 3

  EmpID Age Name
1 1     24  Adam
2 2     30  Mary
3 3     50  John

  EmpID Age Name
3 3     50  John
4 4     35  David
5 5     55  Sarah

**Vector vs. DataFrame**

In [4]:
v <- df$EmpID
paste('is.vector(v): ', is.vector(v))
# the following do the same thing
df[,"EmpID"]
# is.vector(df[,"EmpID"])
df[["EmpID"]]
df[[1]]

# this will return a data.frame
df[1,2:3, drop =FALSE]
paste("is.data.frame(df[1]): ", is.data.frame(df[1]))
paste("is.vector(df[1]): ", is.vector(df[1]))

[1] "is.vector(v):  TRUE"

[1] 1 2 3 4 5

[1] 1 2 3 4 5

[1] 1 2 3 4 5

  Age Name
1 24  Adam

[1] "is.data.frame(df[1]):  TRUE"

[1] "is.vector(df[1]):  FALSE"

In [5]:
c <- df[c("EmpID", "Age")] # all rows, two columns
paste('is.data.frame(c): ', is.data.frame(c))
c
# next two statements are similar
# df[c(1,2)]
# df[1:2]

[1] "is.data.frame(c):  TRUE"

  EmpID Age
1 1     24
2 2     30
3 3     50
4 4     35
5 5     55

In [6]:
# more slicing with index references
# df[rows, columns]
df[1:1,] # first row, all columns 
df[2:4,] # rows 2 through 4, all columns
paste('is.data.frame(df[2:4,]): ', is.data.frame(df[2:4,]))

  EmpID Age Name
1 1     24  Adam

  EmpID Age Name
2 2     30  Mary
3 3     50  John
4 4     35  David

[1] "is.data.frame(df[2:4,]):  TRUE"

In [7]:
df[c(1,4),] # rows 1 and 4, all columns
df[c(1,4), 1:3] # rows 1 and 4, columns 1 through 3
df[c(1,4), c(1,3)] # rows 1 and 4, columns 1 and 2

  EmpID Age Name
1 1     24  Adam
4 4     35  David

  EmpID Age Name
1 1     24  Adam
4 4     35  David

  EmpID Name
1 1     Adam
4 4     David

In [8]:
df[-c(1)] # all but the first column

  Age Name
1 24  Adam
2 30  Mary
3 50  John
4 35  David
5 55  Sarah

** rownames **

In [9]:
#assign rownames to df
rownames(df) <- c("1st", "2nd", "3rd", "4th", "5th") 
df
df["1st",] # get first row

    EmpID Age Name
1st 1     24  Adam
2nd 2     30  Mary
3rd 3     50  John
4th 4     35  David
5th 5     55  Sarah

    EmpID Age Name
1st 1     24  Adam

** logical indexing **

In [10]:
l <- df$Age>30 # logical indexing
l # will show TRUE or FALSE for each row 
df[l,] # get rows that are TRUE

[1] FALSE FALSE  TRUE  TRUE  TRUE

    EmpID Age Name
3rd 3     50  John
4th 4     35  David
5th 5     55  Sarah

In [11]:
df[l,]$Age # get Age values that match criteria
df[l,2] # same as above

[1] 50 35 55

[1] 50 35 55

** Append or Delete Column(s) **

In [12]:
# all these statements will create or overwrite Title column
str(df)
df$Title <- c("Mr", "Ms", "Mr", "Mr", "Mrs")
df[["Title"]] <- c("Mr", "Ms", "Mr", "Mr", "Mrs")
df[,"Title"] <- c("Mr", "Ms", "Mr", "Mr", "Mrs")
# df$Title <- "?" # default value
str(df)

'data.frame':	5 obs. of  3 variables:
 $ EmpID: int  1 2 3 4 5
 $ Age  : num  24 30 50 35 55
 $ Name : chr  "Adam" "Mary" "John" "David" ...
'data.frame':	5 obs. of  4 variables:
 $ EmpID: int  1 2 3 4 5
 $ Age  : num  24 30 50 35 55
 $ Name : chr  "Adam" "Mary" "John" "David" ...
 $ Title: chr  "Mr" "Ms" "Mr" "Mr" ...

In [13]:
# all these will delete the Title column
df$Title <- NULL
df[["Title"]] <- NULL
df[,"Title"] <- NULL
df[[4]] <- NULL
df[,4] <- NULL
str(df)

'data.frame':	5 obs. of  3 variables:
 $ EmpID: int  1 2 3 4 5
 $ Age  : num  24 30 50 35 55
 $ Name : chr  "Adam" "Mary" "John" "David" ...

In [14]:
df$Title = '?' # Making sure column Title exists
# this essentially creates a new df without the Title column
df <- subset(df, select=-Title) # select all but the Title column

** Reorder Columns **

In [15]:
head(df[c(3,1,2)],2) # retrieve a new df with columsn 3,1,2
head(df[, c(3,2,1)],2) # retrieve new df with columns 3,2,1
head(df[,c("Name", "EmpID", "Age")],2) # retrieve new df with named columns

    Name EmpID Age
1st Adam 1     24
2nd Mary 2     30

    Name Age EmpID
1st Adam 24  1
2nd Mary 30  2

    Name EmpID Age
1st Adam 1     24
2nd Mary 2     30

** Joine/Merge dataframes **

In [16]:
# create new df ... 
# note the column is EmployeeID, not EmpID
# note the order of rows is different from df
dfsal <- data.frame("EmployeeID"=c(2,1,4,5,3), "Salary"=c(200,250,100,350,300))
merge(df, dfsal, by.x="EmpID", by.y="EmployeeID")

  EmpID Age Name  Salary
1 1     24  Adam  250
2 2     30  Mary  200
3 3     50  John  300
4 4     35  David 100
5 5     55  Sarah 350

** Add / Delete Rows **

In [17]:
# append a vector as a new row to df
dfNew <- rbind(df, c(6, 50, "Zahid")) 
# bind another data table
dfNew <- rbind(dfNew, data.frame("EmpID"=c(7,8), "Age"=c(25,29), "Name"=c('Sam', 'Rehana')))
dfNew

    EmpID Age Name
1st 1     24  Adam
2nd 2     30  Mary
3rd 3     50  John
4th 4     35  David
5th 5     55  Sarah
6   6     50  Zahid
1   7     25  Sam
2   8     29  Rehana

In [18]:
# remove a row
dfNew[-(6),] # remove 6th row

# split table based on condition
# new df will not have EmpID
dfSplit <- subset(dfNew, Age>30, select=-EmpID)
dfSplit

    EmpID Age Name
1st 1     24  Adam
2nd 2     30  Mary
3rd 3     50  John
4th 4     35  David
5th 5     55  Sarah
1   7     25  Sam
2   8     29  Rehana

    Age Name
3rd 50  John
4th 35  David
5th 55  Sarah
6   50  Zahid

** Rename Columns **

In [19]:
df$Years <- 0 # add a new column
names(df)[4] <- "Yrs" #rename it from Years to Yrs
names(df)[names(df) =="Years"] <- "Yrs" #rename it from Years to Yrs
names(df) # get columns names
df$Yrs <- NULL # remove column

[1] "EmpID" "Age"   "Name"  "Yrs"

** Order / Sort **

In [20]:
df[order(df$Age),]
df[order(-df$Age),] # reverse order
df[rev(order(df$Name)),] # reverse order, characters
# df[order(-xtfrm(df$Name)),] # reverse order, characters (another way)

    EmpID Age Name
1st 1     24  Adam
2nd 2     30  Mary
4th 4     35  David
3rd 3     50  John
5th 5     55  Sarah

    EmpID Age Name
5th 5     55  Sarah
3rd 3     50  John
4th 4     35  David
2nd 2     30  Mary
1st 1     24  Adam

    EmpID Age Name
5th 5     55  Sarah
2nd 2     30  Mary
3rd 3     50  John
4th 4     35  David
1st 1     24  Adam